[
    {
        "title": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1170803558l/72193._SX318_SY475_.jpg",
        "description": "Harry Potter thinks he is an ordinary boy - until he is rescued by an owl, taken to Hogwarts School of Witchcraft and Wizardry, learns to play Quidditch and does battle in a deadly duel. The Reason ... HARRY POTTER IS A WIZARD!",
        "edidtion": "UK Edition",
        "pages": 223,
        "publishing_date": "June 30th 1997",
        "publisher": "Bloomsbury Publishing",
        "serie":"Harry Potter",
        "part_of_series":1
    },
    {
        "title": "Harry Potter and the Chamber of Secrets",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1474169725l/15881._SY475_.jpg",
        "description": "Harry Potter, along with his best friends, Ron and Hermione, is about to start his third year at Hogwarts School of Witchcraft and Wizardry. Harry can't wait to get back to school after the summer holidays. (Who wouldn't if they lived with the horrible Dursleys?) But when Harry gets to Hogwarts, the atmosphere is tense. There's an escaped mass murderer on the loose, and the sinister prison guards of Azkaban have been called in to guard the school... ",
        "edidtion": "First American Edition",
        "pages": 341,
        "publishing_date": "June 2nd 1999",
        "publisher": "Arthur A. Levine Books",
        "serie":"Harry Potter",
        "part_of_series":2
    },
    {
        "title": "Harry Potter and the Prisoner of Azkaban",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630547330i/5._SY180_.jpg",
        "description": "Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he’s packing his bags, Harry receives a warning from a strange impish creature who says that if Harry returns to Hogwarts, disaster will strike.\n\n And strike it does. For in Harry’s second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girls’ bathroom. But then the real trouble begins – someone is turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects… Harry Potter himself!",
        "edidtion": "Mass Market Paperback",
        "pages": 435,
        "publishing_date": "May 1st 2004",
        "publisher": "Scholastic Inc.",
        "serie":"Harry Potter",
        "part_of_series":3
    },
    {
        "title": "Harry Potter and the Goblet of Fire",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1630547330i/5._SY180_.jpg",
        "description": "Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he’s packing his bags, Harry receives a warning from a strange impish creature who says that if Harry returns to Hogwarts, disaster will strike. And strike it does. For in Harry’s second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girls’ bathroom. But then the real trouble begins – someone is turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects… Harry Potter himself!",
        "edidtion": "Mass Market Paperback",
        "pages": 435,
        "publishing_date": "May 1st 2004",
        "publisher": "Scholastic Inc.",
        "serie":"Harry Potter",
        "part_of_series":4
    },
    {
        "title": "Harry Potter and the Order of the Phoenix",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1660911061l/2.jpg",
        "description": "Harry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays, but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him.\n\nHarry has had enough. He is beginning to think he must do something, anything, to change his situation, when the summer holidays come to an end in a very dramatic fashion. What Harry is about to discover in his new year at Hogwarts will turn his world upside down...",
        "edidtion":"US Edition",
        "pages": 912,
        "publishing_date": "May 1st 2004",
        "publisher": "Scholastic Inc.",
        "serie":"Harry Potter",
        "part_of_series":5
    },
    {
        "title": "Harry Potter and the Half-Blood Prince",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1587697303l/1._SX318_.jpg",
        "description": "It is the middle of the summer, but there is an unseasonal mist pressing against the windowpanes. Harry Potter is waiting nervously in his bedroom at the Dursleys' house in Privet Drive for a visit from Professor Dumbledore himself. One of the last times he saw the Headmaster was in a fierce one-to-one duel with Lord Voldemort, and Harry can't quite believe that Professor Dumbledore will actually appear at the Dursleys' of all places. Why is the Professor coming to visit him now? What is it that cannot wait until Harry returns to Hogwarts in a few weeks' time? Harry's sixth year at Hogwarts has already got off to an unusual start, as the worlds of Muggle and magic start to intertwine... ",
        "edidtion":"Paperback",
        "pages": 912,
        "publishing_date": "September 16th 2006",
        "publisher": "Scholastic Inc.",
        "serie":"Harry Potter",
        "part_of_series":6
    },
    {
        "title": "Harry Potter and the Deathly Hallows",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1663805647l/136251.jpg",
        "description": "Harry has been burdened with a dark, dangerous and seemingly impossible task: that of locating and destroying Voldemort's remaining Horcruxes. Never has Harry felt so alone, or faced a future so full of shadows. But Harry must somehow find within himself the strength to complete the task he has been given. He must leave the warmth, safety and companionship of The Burrow and follow without fear or hesitation the inexorable path laid out for him...\n\nIn this final, seventh installment of the Harry Potter series, J.K. Rowling unveils in spectacular fashion the answers to the many questions that have been so eagerly awaited",
        "edidtion":"Hardcover",
        "pages":  759,
        "publishing_date": "July 21st 2007",
        "publisher": "Arthur A. Levine Books",
        "serie":"Harry Potter",
        "part_of_series":7
    },
    {
        "title": "The Lightning Thief",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400602609l/28187.jpg",
        "description": "Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods.",
        "edidtion":"First edition",
        "pages":  377,
        "publishing_date": "March 1st 2006",
        "publisher": "Disney Hyperion Books",
        "serie":"Percy Jackson and the Olympians",
        "part_of_series":1
    },
    {
        "title": "The Sea of Monsters",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400602661l/28186.jpg",
        "description": "The heroic son of Poseidon makes an action-packed comeback in the second must-read installment of Rick Riordan's amazing young readers series. Starring Percy Jackson, a \"half blood\" whose mother is human and whose father is the God of the Sea, Riordan's series combines cliffhanger adventure and Greek mythology lessons that results in true page-turners that get better with each installment.\n\nIn this episode, The Sea of Monsters, Percy sets out to retrieve the Golden Fleece before his summer camp is destroyed, surpassing the first book's drama and setting the stage for more thrills to come.",
        "edidtion":"First edition",
        "pages":279,
        "publishing_date": "April 1st 2006",
        "publisher": "Hyperion Books",
        "serie":"Percy Jackson and the Olympians",
        "part_of_series":2
    },
    {
        "title": "The Titan's Curse",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1361038385l/561456.jpg",
        "description": "It's not everyday you find yourself in combat with a half-lion, half-human.\n\nBut when you're the son of a Greek god, it happens. And now my friend Annabeth is missing, a goddess is in chains and only five half-blood heroes can join the quest to defeat the doomsday monster.\n\nOh, and guess what? The Oracle has predicted that not all of us will survive... ",
        "edidtion":"Paperback",
        "pages":320,
        "publishing_date": "May 5th 2007",
        "publisher": "Puffin Books",
        "serie":"Percy Jackson and the Olympians",
        "part_of_series":3
    },
    {
        "title": "The Battle of the Labyrinth",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1518607478l/2120932.jpg",
        "description": "Percy Jackson isn't expecting freshman orientation to be any fun. But when a mysterious mortal acquaintance appears at his potential new school, followed by demon cheerleaders, things quickly move from bad to worse.\n\nIn this fourth installment of the blockbuster series, time is running out as war between the Olympians and the evil Titan lord Kronos draws near. Even the safe haven of Camp Half-Blood grows more vulnerable by the minute as Kronos's army prepares to invade its once impenetrable borders. To stop the invasion, Percy and his demigod friends must set out on a quest through the Labyrinth - a sprawling underground world with stunning surprises at every turn.",
        "edidtion":"Hardcover",
        "pages":361,
        "publishing_date": "March 6th 2008",
        "publisher": "Hyperion Books for Children",
        "serie":"Percy Jackson and the Olympians",
        "part_of_series":4
    },
    {
        "title": "The Last Olympian",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1519022209l/4556058._SX318_.jpg",
        "description": "All year the half-bloods have been preparing for battle against the Titans, knowing the odds of victory are grim. Kronos's army is stronger than ever, and with every god and half-blood he recruits, the evil Titan's power only grows.\n\nWhile the Olympians struggle to contain the rampaging monster Typhon, Kronos begins his advance on New York City, where Mount Olympus stands virtually unguarded. Now it's up to Percy Jackson and an army of young demigods to stop the Lord of Time.\n\nIn this momentous final book in the New York Times best-selling series, the long-awaited prophecy surrounding Percy's sixteenth birthday unfolds. And as the battle for Western civilization rages on the streets of Manhattan, Percy faces a terrifying suspicion that he may be fighting against his own fate.",
        "edidtion":"Hardcover",
        "pages":381,
        "publishing_date": "March 5th 2009",
        "publisher": "Disney-Hyperion Books",
        "serie":"Percy Jackson and the Olympians",
        "part_of_series":5
    }



]